Repository: sslavik/acdat
Catalog: TMXParser/en-es.tmx
Source language: en
Languages: es

source: The search filter can be simple or advanced, using boolean operators in the format described in the LDAP doumentation (see the Netscape Directory SDK for full information on filters).
es: El filtro de búsqueda puede ser simple o avanzado, usando operadores booleanos en el formato descrito en la documentación sobre LDAP (Consulte el Netscape Directory SDK para obtener completa información sobre filtros).

source: This example uses a boolean filter to tell the server to look for information in more than one attribute.
es: El ejemplo de abajo recupera la unidad organizativa (ou), apellidos nombre común y dirección de email para todas las personas de "Mi Compañía "donde los apellidos o el nombre común contiene la subcadena $persona.

source: To do this you use an array of link identifiers, rather than a single identifier, as the first argument.
es: Este ejemplo usa un filtro booleano para indicar al servidor que busque la información en más de un atributo.

source: If you don 't want the same base DN and the same filter for all the searches, you can also use an array of base DNs and / or an array of filters.
es: Ejemplo 1.

source: When doing parallel searches an array of search result identifiers is returned, except in case of error, then the entry corresponding to the search will be FALSE.
es: Búsqueda LDAP

source: There are some rare cases where the normal search returns FALSE while the parallel search returns an identifier.
es: / / $ds es un identificador de conexión válido / / $persona es todo o parte del nombre de una persona, por ejemplo "Pe" $dn = "o=Mi Compañía, c=ES"; $filtro="(_BAR_(sn=$persona*)(givenname=$persona*))"; $solonecesito = array ("ou", "sn", "givenname", "mail"); $sr=ldap_search($ds, $dn, $filtro, $solonecesito); $info = ldap_get_entries($ds, $sr); print $info["count"]. "entradas devueltas p";

source: Returns TRUE on success or FALSE on failure. on error.
es: Devuelve TRUE si todo fue bien, FALSE en caso de fallo. on error.

source: ldap_unbind() function unbinds from the LDAP directory.
es: La función ldap_unbind() hace logout, desautentifica de un directorio LDAP.

source: Mail functions
es: Funciones de Correo

source: In its simplest form the function will take only the two strings as parameter and will calculate just the number of insert, replace and delete operations needed to transform str1 into str2.
es: Esta función devuelve la distancia Levenshtein entre las dos cadenas argumento, ó -1 si alguna de las cadenas tiene más de 255 caracteres.

source: This is more general and adaptive than variant one, but not as efficient.
es: La distancia Levenshtein se define como el mínimo número de caracteres que se tienen que sustituir, insertar o borrar para transformar cad1 en cad2.

source: It will call a user-supplied function that will determine the cost for every possible operation.
es: La complejidad del algoritmo es O( m*n), donde n y m son las longitudes de cad1 y cad2 (bastante bueno si se la compara con similar_text(), que es O(max(n,m)**3), pero aún es cara).

source: operation to apply: 'I', 'R' or'D '
es: Vea también soundex(), similar_text() y metaphone().

source: link() creates a hard link.
es: link() crea un enlace fuerte.

source: See also the symlink() to create soft links, and readlink() along with linkinfo().
es: Ver también symlink() para crear enlaces débiles, y readlink() junto con linkinfo().

source: linkinfo() returns the st_dev field of the UNIX C stat structure returned by the lstat system call.
es: linkinfo() da el campo st_dev de la extructura stat de UNIX C devuelto por la llamada al sistema lstat.

source: This function is used to verify if a link (pointed to by path) really exists (using the same method as the S_ISLNK macro defined in stat.h).
es: Esta función se usa para verificar si un enlace (apuntado por path) existe realmente (usando el mismo método que la macro S_ISLNK definida en stat.h).

source: Returns 0 or FALSE in case of error.
es: Devuelve 0 o FALSE en caso de error.

source: See also symlink(), link(), and readlink().
es: Ver también symlink(), link(), y readlink().

source: Example 1. list() examples
es: Como array(), esta no es realmente una función, sino una construcción del lenguaje. list() se usa para asignar una lista de variables en una sola operación.

source: An example use of list()
es: Ejemplo 1.

source: list() assigns the values starting with the right-most parameter.
es: Ejemplo de list()

source: But if you are using arrays with indices you usually expect the order of the indices in the array the same you wrote in the list() from left to right; which it isn't.
es: table tr th Nombre empleado / th th Sueldo / th / tr ?php $resultado = mysql( $conn, "SELECT id, nombre, salario FROM empleados"); while (list($id, $nombre, $salario) = mysql_fetch_row($resultado)) {print( "tr \n"." td a href=\"info.php3?id=$id\ "$nombre / a / td \n"." td $salario / td \n". "/ tr \n");}? / table

source: array( 3) {[2]= string(8) "caffeine "[1]= string(5) "brown" [0]= string(6) "coffee "}
es: Vea también: each(), array().

source: Example 1. localeconv() example
es: Ejemplo 1. localeconv() example

source: The localtime() function returns an array identical to that of the structure returned by the C function call.
es: La función localtime() devuelve un vector idético al de la estructura devuelta en C por la llamada a la misma función.

source: The first argument to localtime() is the timestamp, if this is not given the current time is used.
es: Si no se proporciona, se utilizará la hora actual.

source: The second argument to the localtime() is the is_associative, if this is set to 0 or not supplied than the array is returned as a regular, numerically indexed array.
es: Si está a 0 o no es proporcionado, el vector se devuelve como un vector normal, indizado numéricamente.

source: If the argument is set to 1 then localtime() is an associative array containing all the different elements of the structure returned by the C function call to localtime.
es: Si el argumento está a 1, el vector devuelto es un vector asociativo conteniendo los diferentes elementos de la estructura devuelta por C al llamar a la función localtime.

source: The names of the different keys of the associative array are as follows:
es: Los nombres de las diferentes claves del vector asociativo se encuentran a continuación:

source: "tm_sec" - seconds
es: "tm_sec" - segundos

source: "tm_min" - minutes
es: "tm_min" - minutos

source: "tm_hour" - hour
es: "tm_hour" - horas

source: "tm_mday" - day of the month
es: "tm_mday" - día del mes

source: "tm_mon" - month of the year, starting with 0 for January
es: "tm_mon" - mes del año, empezando en 0 que es Enero

source: "tm_year" - Years since 1900
es: "tm_year" - Años que hacen desde 1900

source: "tm_wday" - Day of the week
es: "tm_wday" - Día de la semana

source: "tm_yday" - Day of the year
es: "tm_yday" - Día del año

source: "tm_isdst" - Is daylight savings time in effect
es: "tm_isdst" - Si el cambio de hora para el ahorro energético tiene efecto o no

source: Returns the base-10 logarithm of arg.
es: Devuelve el logaritmo en base-10 de arg.

source: As always you can calculate the logarithm in base b of a number n, but using the mathematical identity: log b (n) = log(n) / log(b), where log is the neperian (or natural) logarithm.
es: Devuelve el logaritmo de arg.

source: Gathers the statistics of the file or symbolic link named by filename.
es: Reúne los datos del fichero o enlace simbólico indicado por filename.

source: This function is identical to the stat() function except that if the filename parameter is a symbolic link, the status of the symbolic link is returned, not the status of the file pointed to by the symbolic link.
es: Esta función es idéntica a la función stat() excepto que si el nombre en el parámetro filename es un enlace simbólico, son devueltos los datos (status) del enlace simbólico, y no los del fichero al que apunta el enlace simbólico.

source: Returns an array with the statistics of the file with the following elements:
es: Devuelve un array conteniendo los datos del fichero con los siguientes elementos:

source: inode
es: dispositivo (device)

source: number of links
es: número de enlaces

source: user id of owner
es: id de usuario del propietario

source: group id owner
es: id de grupo del propietario

source: size in bytes
es: tipo de disposivo si es un inode device *

source: time of last access
es: tamaño en bytes

source: time of last modification
es: fecha del último acceso

source: time of last change
es: fecha de la última modificación

source: blocksize for filesystem I / O *
es: fecha del último cambio

source: number of blocks allocated
es: tamaño de bloque para el sistema I / O *

source: lstat() cannot be used on remote files.
es: número de bloques ocupados

source: Without the second parameter, ltrim() will strip these characters:
es: Esta función elimina el espacio en blanco del principio de una cadena y devuelve la cadena resultante.

source: You can also specify the characters you want to strip, by means of the charlist You can also specify the characters you want to strip, by means of the charlist parameter.
es: Los caracteres de espacio que elimina realmente son: "\n", "\r", "\t", "\v", "\0", y el espacio en sí.

source: With.. you can specify a range of characters.
es: Vea también chop() y trim().

source: This is accomplished via MIME-encoding - for more information, see this Zend article or the PEAR Mime Classes.
es: mail() envía automáticamente el mensaje especificado en mensage al destinatario especificado en para.

source: mail() returns TRUE if the mail was successfully accepted for delivery, FALSE otherwise.
es: Para especificar múltiples destinatarios se puede hacer incluyendo una coma entre las direcciones en para.

source: The Windows implementation of mail() differs in many ways from the Unix implementation.
es: Ejemplo 1.

source: Second, the custom headers like From:, Cc:, Bcc: and Date: are not interpreted by the MTA in the first place, but are parsed by PHP.
es: Enviando correo.

source: PHP = 4.3 supports all the mentioned header elements and is no longer case-sensitive.
es: mail( "pepito@loquesea.es", "Sobre este tema", "Linea 1\nLinea 2\nLinea 3");

source: If a fourth string argument is passed, this string is inserted at the end of the header.
es: Si se añadiera una cadena como cuarto argumento, esta cadena sería enviada al final de la cabecera.

source: mail( "nobody@example.com", "the subject", $message, "From: webmaster@$SERVER_NAME\r\n "."Reply-To: webmaster@$SERVER_NAME\r\n". "X-Mailer:
es: Si se desea enviar varias cabeceras extra el mecanismo será el mismo separándolas una linea.

source: You may need to add the user that your web server runs as to your sendmail configuration to prevent a 'X-Warning' header from being added to the message when you set the envelope sender using this method.
es: Ejemplo 2.

source: mail( "nobody@example.com", "the subject", $message, "From: webmaster@$SERVER_NAME", "-fwebmaster@$SERVER_NAME");
es: Enviando correo con varias cabeceras.

source: You can also use simple string building techniques to build complex email messages.
es: mail( "pepito@loquesea.es", "El tema", $message, "From: webmaster@$SERVER_NAME\nReply-To: webmaster@$SERVER_NAME\nX-Mailer:

source: max() returns the numerically highest of the parameter values.
es: max() devuelve el número mayor de los valores de los parámetros.

source: If the first parameter is an array, max() returns the highest value in that array.
es: Si el primer parámetro es un array, max() devuelve el mayor valor en ese array.

source: If the first parameter is an integer, string or float, you need at least two parameters and max() If the first parameter is an integer, string or float, you need at least two parameters and max() returns the biggest of these values.
es: Si el primer parámetro es un entero, string o double, necesita al menos dos parámetros y max() devuelve el mayor número de estos valores.

source: You can compare an unlimited number of values.
es: Puede comparar un número ilimitado de valores.

source: If one or more of the values is a float, all the values will be treated as floats, and a float is returned.
es: Si uno o más de los valores es un double, todos los valores serán tratados como doubles, y devolverá un double.

source: See also min().
es: Si ninguno de los valores es un double, todos ellos serán tratados como enteros, y se devolverá un entero.

source: Example 1. mb_convert_case() example
es: Ejemplo 1. mb_convert_case() example

source: Example 1. mb_convert_encoding() example
es: Ejemplo 1. mb_convert_encoding() example

source: Example 1. mb_convert_kana() example
es: Ejemplo 1. mb_convert_kana() example

source: Example 1. mb_convert_variables() example
es: Ejemplo 1. mb_convert_variables() example

source: Example 1. convmap example
es: Ejemplo 1. convmap example

source: Example 1. mb_detect_encoding() example
es: Ejemplo 1. mb_detect_encoding() example

source: Example 2. mb_detect_order() examples
es: Ejemplo 2. mb_detect_order() examples

source: Example 2. mb_encode_numericentity() example
es: Ejemplo 2. mb_encode_numericentity() example

source: Example 1. mb_internal_encoding() example
es: Ejemplo 1. mb_internal_encoding() example

source: Example 1. mb_output_handler() example
es: Ejemplo 1. mb_output_handler() example

source: Example 1. mb_preferred_mime_string() example
es: Ejemplo 1. mb_preferred_mime_string() example

source: Example 1. mb_strimwidth() example
es: Ejemplo 1. mb_strimwidth() example

source: Example 1. mb_strtolower() example
es: Ejemplo 1. mb_strtolower() example

source: Example 1. mb_strtoupper() example
es: Ejemplo 1. mb_strtoupper() example

source: Example 1. mb_substitute_character() example
es: Ejemplo 1. mb_substitute_character() example

source: Example 1. mb_substr_count() example
es: Ejemplo 1. mb_substr_count() example

source: Returns the id of the newly inserted event.
es: Returns the uid of the newly inserted event.

source: Possible return values range from 0 for Sunday through 6 for Saturday.
es: mcal_day_of_week() returns the day of the week of the given date

source: mcal_delete_event() deletes the calendar event specified by the event_id.
es: mcal_delete_event() deletes the calendar event specified by the uid.

source: mcal_fetch_current_stream_event() returns the current stream's event structure as an object containing:
es: mcal_event_fetch_current_stream_event() returns the current stream 's event structure as an object containing:

source: mcal_is_leap_year() returns 1 if the given year is a leap year, 0 if not.
es: mcal_is_leap_year() returns 1 if the given year is a leap year, 1 if not.

source: Returns an array of ID 's that are between the start and end dates, or if just a stream is given, uses the start and end dates in the global event structure.
es: Returns an array of event ID 's that are between the start and end dates, or if just a stream is given, uses the start and end dates in the global event structure.

source: mcal_list_events() function takes in an beginning date and an optional end date for a calendar stream.
es: mcal_list_events() function takes in an optional beginning date and an end date for a calendar stream.

source: mcal_snooze() turns off an alarm for a calendar event specified by the id.
es: mcal_snooze() turns off an alarm for a calendar event specified by the uid.

source: Returns the event id of the modified event on success and FALSE on error.
es: Returns TRUE on success and FALSE on error.

source: mcal_time_valid
es: Siguiente

source: Mcrypt Encryption Functions
es: Funciones Criptográficas

source: (PHP 3 = 3.0.8, PHP 4)
es: mcrypt_cbc() encripta o desencripta (dependiendo de mode) los datos data con el cifrado cipher y la clave key en el modo de cifrado CBC y devuelve la cadena resultante.

source: The first prototype is when linked against libmcrypt 2.2.x, the second when linked against libmcrypt 2.4.x or higher.
es: key es la clave suministrada al algoritmo.

source: This function should not be used anymore, see mcrypt_generic() and mdecrypt_generic() for replacements.
es: Ver también: mcrypt_cfb(), mcrypt_ecb(), mcrypt_ofb()

source: mcrypt_create_iv() is used to create an IV.
es: mcrypt_create_iv() se usa para crear un IV.

source: mcrypt_create_iv() takes two arguments, size determines the size of the IV, source specifies the source of the IV.
es: mcrypt_create_iv() toma dos argumentos, size determina el tamaño del IV, source especifica la fuente del IV.

source: If you use MCRYPT_RAND, make sure to call srand() before to initialize the random number generator.
es: La fuente puede ser MCRYPT_RAND (generador de números aleatorios del sistema), MCRYPT_DEV_RANDOM (que lee datos de / dev / random) y MCRYPT_DEV_URANDOM (que lee datos de / dev / urandom).

source: ?php $size = mcrypt_get_iv_size (MCRYPT_CAST_256, MCRYPT_MODE_CFB); $iv = mcrypt_create_iv ($size, MCRYPT_DEV_RANDOM);?
es: Si usas MCRYPT_RAND, asegurate de llamar antes a srand() para inicializar el generador de números aleatorios.

source: The IV is only meant to give an alternative seed to the encryption routines.
es: Ejemplo 1.

source: This IV does not need to be secret at all, though it can be desirable.
es: Ejemplo de mcrypt_create_iv

source: More information can be found at http: / /www.ciphersbyritter.com / GLOSSARY.HTM#IV, http: / /fn2.freenet.edmonton.ab.ca / ~jsavard / crypto / co0409.htm and in chapter 9.3 of Applied Cryptography by Schneier (ISBN 0-471-11709-9) for a discussion of this topic.
es: ?php $cipher = MCRYPT_TripleDES; $block_size = mcrypt_get_block_size($cipher); $iv = mcrypt_create_iv($block_size, MCRYPT_DEV_RANDOM);?

source: Example 1. mcrypt_enc_get_algorithms_name() example
es: Ejemplo 1. mcrypt_enc_get_algorithms_name() example

source: Example 1. mcrypt_enc_get_modes_name() example
es: Ejemplo 1. mcrypt_enc_get_modes_name() example

source: Example 1. mcrypt_enc_get_supported_key_sizes() example
es: Ejemplo 1. mcrypt_enc_get_supported_key_sizes() example

source: Example 1. mcrypt_encrypt() Example
es: Ejemplo 1. mcrypt_encrypt() Example

source: This example shows how to use this function when linked against libmcrypt 2.4.x and 2.5.x.
es: mcrypt_get_block_size() se usa para obtener el tamaño de bloque del cifrado indicado en cipher.

source: ?php echo mcrypt_get_block_size ('tripledes', 'ecb');?
es: mcrypt_get_block_size() toma un argumento, el cifrado cipher y devuelve el tamaño en bytes.

source: See also: mcrypt_get_key_size() and mcrypt_encrypt().
es: Ver también: mcrypt_get_key_size()

source: mcrypt_get_cipher_name() is used to get the name of the specified cipher.
es: mcrypt_get_cipher_name() se usa para obtener el nombre del cifrado especificado.

source: mcrypt_get_cipher_name() takes the cipher number as an argument (libmcrypt 2.2.x) or takes the cipher name as an argument (libmcrypt 2.4.x or higher) and returns the name of the cipher or FALSE, if the cipher does not exist.
es: mcrypt_get_cipher_name() toma como argumento el número de cifrado y devuelve el nombre del cifrado o FALSE, si el cifrado no existe.

source: Example 1. mcrypt_get_cipher_name() Example
es: Ejemplo de mcrypt_get_cipher_name

source: ?php $cipher = MCRYPT_TripleDES; echo mcrypt_get_cipher_name ($cipher);?
es: ?php $cipher = MCRYPT_TripleDES; print mcrypt_get_cipher_name($cipher);?

source: 3DES
es: TripleDES

source: Example 1. mcrypt_create_iv() example
es: Ejemplo 1. mcrypt_create_iv() example

source: ?php echo mcrypt_get_key_size ('tripledes', 'ecb');?
es: mcrypt_get_key_size() toma un argumento, el cifrado cipher y devuelve el tamaño de la clave en bytes.

source: See also: mcrypt_get_block_size() and mcrypt_encrypt().
es: Ver también: mcrypt_get_block_size()

source: Example 1. mcrypt_list_algorithms() Example
es: Ejemplo 1. mcrypt_list_algorithms() Example

source: Example 1. mcrypt_list_modes() Example
es: Ejemplo 1. mcrypt_list_modes() Example

source: Example 1. mcrypt_module_open() Example
es: Ejemplo 1. mcrypt_module_open() Example

source: Mhash Functions
es: Funciones Hash

source: The hash is a 32-character hexadecimal number.
es: Calcula el hash (extracto) MD5 de cad usaneo el Algoritmo de Resumen de Mensajes MD5 de RSA Data Security, Inc..

source: See also crc32(), md5_file(), and sha1().
es: Vea también: crc32()

source: Example 1. mdecrypt_generic() Example
es: Ejemplo 1. mdecrypt_generic() Example

source: Calculates the metaphone key of str.
es: Calcula la clave "metáfona" de cad.

source: Similar to soundex() metaphone creates the same key for similar sounding words.
es: Similarmente a soundex(), metaphone crea la misma clave para palabras que suenan parecidas.

source: It' s more accurate than soundex() It's more accurate than soundex() as it knows the basic rules of English pronunciation.
es: Las claves metafónicas generadas son de longitud variable.

source: The metaphone generated keys are of variable length.
es: Metaphone fue desarrollado por Lawrence Philips lphilips@verity.com.

source: Metaphone was developed by Lawrence Philips lphilips@verity.com.
es: Se describe en ["Practical Algorithms for Programmers", Binstock Rex, Addison Wesley, 1995].

source: It is described in ["Practical Algorithms for Programmers", Binstock Rex, Addison Wesley, 1995].
es: Esta función se añadió en PHP 4.0.

source: This function returns TRUE if the method given by method_name has been defined for the given object, FALSE otherwise.
es: Esta función devuelve verdadero (TRUE) si el metódo referido por method_name ha sido definido en el objecto object, en cualquier otro caso devuelve falso (FALSE)

source: ClibPDF functions
es: Funciones de ClibPDF

source: mhash_count() returns the highest available hash id.
es: mhash_count() devuelve el valor mas alto id hash disponible.

source: Hashes are numbered from 0 to this hash id.
es: Los hash estan numerados desde 0 hasta este valor.

source: Traversing all hashes
es: Recorriendo todos los hash

source: mhash_get_block_size() is used to get the size of a block of the specified hash.
es: mhash_get_block_size() es usado para obtener el tamaño de un bloque de el hash determinado.

source: mhash_get_block_size() takes one argument, the hash and returns the size in bytes or FALSE, if the hash does not exist.
es: mhash_get_block_size() toma un argumento, el hash y devuelve el tamaño en bytes o FALSE, si el hash no existe.

source: mhash_get_hash_name() is used to get the name of the specified hash.
es: mhash_get_hash_name() es usado para conseguir el nombre de el hash determinado.

source: mhash_get_hash_name() takes the hash id as an argument and returns the name of the hash or FALSE, if the hash does not exist.
es: mhash_get_hash_name() toma el id del hash como un argumento y devuelve el nombre de el hash o FALSE, si el hash no existe.

source: Example 1. mhash_get_hash_name() example
es: Ejemplo 1. mhash_get_hash_name example

source: The above example will print out:
es: ?php $hash = MHASH_MD5; print mhash_get_hash_name($hash);?

source: Not all algorithms supported in mhash can be used in HMAC mode.
es: mhash() aplica una funcion hash especificada por hash a data y devuelve el valor hash resultante (tambien llamdo digest).

source: This function is only available on operating systems that support the gettimeofday() system call.
es: Devuelve la cadena "msec sec", donde sec es la hora actual en número de segundos desde el valor Unix Epoch (0:00:00 del 1 de enero de 1970, hora GMT), y msec es la parte de microsegundos.

source: Example 1. microtime() example
es: Esta función sólo está disponible en sistemas operativos con admiten la llamada al sistema gettimeofday().

source: See also time().
es: Ver también time().
